/*Задача №1
 Вывести на экран Первую букву имени из символов "*" (звездочка)
 (Мустафа(М))*/

#include "iostream";

using namespace std;

int main() {

	cout <<"**        **" << endl
		<< "* *      * *" << endl
		<< "*  *    *  *" << endl
		<< "*   *  *   *" << endl
		<< "*    *     *" << endl
		<< "*          *" << endl
		<< "*          *" << endl
		<< "*          *" << endl;
	getchar();
	getchar();
	return 0;
}